[
    {
        "date": "29-09-2025",
        "title": "Global Major update",
        "update": [
            {
                "name": "Карточки игр",
                "desc": "Оформление карточек игр было изменено. Так же добавлена возможность перехода на страницу игры, в зависимости откуда была получена информация от игры (wiki / steam)."
            },
            {
                "name": "Компоненты",
                "desc": "Часть компонентов были написаны с нуля, за место компонентов Antd."
            },
            {
                "name": "Страница профиля",
                "desc": "Страница профиля была полностью переработана."
            }
        ]
    },
    {
        "date": "16-08-2025",
        "title": "Major update",
        "update": [
            {
                "name": "Компоненты Antd",
                "desc": "Компоненты Antd были стилизованы в соответствии с дизайном."
            },
            {
                "name": "Карточки игр",
                "desc": "Были полностью переработаны. Сделан новый дизайн. Описание игр ушло в модальное окно."
            },
            {
                "name": "Модальное окно игры",
                "desc": "Было реализовано модальное окно, в котором находится полная информация об игре, а так же откуда была получена информация."
            },
            {
                "name": "Мелочи",
                "desc": "Небольшой рефактор кода."
            }
        ]
    },
    {
        "date": "14-08-2025",
        "title": "Major update",
        "update": [
            {
                "name": "Поиск",
                "desc": "Создан поиск с помощью которого можно ковыряться в своей библиотеке"
            },
            {
                "name": "Сортировка",
                "desc": "Создана сортировка с помощью которой можно ковыряться в своей библиотеке"
            },
            {
                "name": "Вкладки",
                "desc": "Созданы вкладки с помощью которых можно ковыряться в своей библиотеке..."
            },
            {
                "name": "Пагинация",
                "desc": "Создана пагинация с помощью которой можно ковыряться в своей библиотеке... Мне серьезно надо писать это в четвертый раз?"
            },
            {
                "name": "Страница все игры",
                "desc": "Создана страница со всеми играми в базе данных"
            },
            {
                "name": "Добавление игр из страницы Все игры",
                "desc": "Теперь возможно добавление игр со страницы Все игры путем изменения статуса игры"
            },
            {
                "name": "Стили",
                "desc": "Ну всякие стили из Ant Design поковырял и прочее"
            }

        ]
    },
    {
        "date": "13-08-2025",
        "title": "Minor bugfix",
        "update": [
            {
                "name": "Сайдбар",
                "desc": "Сайдбар был перенсен в AppHeader. Выглядит хайпово"
            },
            {
                "name": "Кнопки добавления игр",
                "desc": "Обновлены. Новые ситил"
            }
        ]
    }
]
